/* This computer's Internet connection appears to be offline. */
"CONNECTION_DOWN" = "Kết nối Internet của máy tính này có vẻ như không hoạt động.";

/* This computer's Internet connection may be offline. */
"CONNECTION_INDETERMINATE" = "Kết nối Internet của máy tính này có thể là ngoại tuyến.";

/* This computer's Internet connection appears to be online. */
"CONNECTION_UP" = "Kết nối Internet của máy tính này có vẻ như đang hoạt động.";

/* This computer's DNS server is not responding. */
"NAMESERVER_DOWN" = "Máy chủ DNS của máy tính này không phản hồi.";

/* The DNS server could not find the server name. */
"NAMELOOKUP_FAILED" = "Máy chủ DNS không thể tìm thấy tên máy chủ.";

/* This computer's router is not responding. */
"ROUTER_DOWN" = "Bộ định tuyến của máy tính này không phản hồi.";

/* The server this computer is attempting to connect to is not responding. */
"SERVER_DOWN" = "Máy chủ mà máy tính này đang cố gắng kết nối không phản hồi.";

/* This computer's Internet connection appears to be online. */
"SERVER_UP" = "Kết nối Internet của máy tính này có vẻ như đang hoạt động.";

/* Format string for label of a saved password in Keychain: URL (USERNAME) */
"KEYCHAIN_LABEL_FORMAT" = "%@ (%@)";

/* Kind string used for keychain items from forms-based logins */
"KEYCHAIN_WEB_FORM_PASSWORD" = "Mật khẩu mẫu web";

/* HTTP result code string */
"accepted" = "đã chấp nhận";

/* HTTP result code string */
"bad gateway" = "cổng kết nối không hợp lệ";

/* HTTP result code string */
"bad request" = "yêu cầu không hợp lệ";

/* HTTP result code string */
"client error" = "lỗi máy khách";

/* HTTP result code string */
"conflict" = "xung đột";

/* HTTP result code string */
"continue" = "tiếp tục";

/* HTTP result code string */
"created" = "đã tạo";

/* HTTP result code string */
"expectation failed" = "mong đợi không thành công";

/* HTTP result code string */
"forbidden" = "bị cấm";

/* HTTP result code string */
"found" = "đã tìm thấy";

/* HTTP result code string */
"gateway timed out" = "cổng kết nối hết thời gian chờ";

/* HTTP result code string */
"informational" = "có thông tin";

/* HTTP result code string */
"internal server error" = "lỗi máy chủ nội bộ";

/* HTTP result code string */
"length required" = "yêu cầu độ dài";

/* HTTP result code string */
"method not allowed" = "phương pháp không được phép";

/* HTTP result code string */
"moved permanently" = "di chuyển vĩnh viễn";

/* HTTP result code string */
"multiple choices" = "nhiều lựa chọn";

/* HTTP result code string */
"needs proxy" = "cần proxy";

/* HTTP result code string */
"no content" = "không có nội dung";

/* HTTP result code string */
"no error" = "không có lỗi";

/* HTTP result code string */
"non-authoritative information" = "thông tin không chính thức";

/* HTTP result code string */
"not found" = "không tìm thấy";

/* HTTP result code string */
"not modified" = "không sửa đổi";

/* HTTP result code string */
"partial content" = "nội dung một phần";

/* HTTP result code string */
"payment required" = "yêu cầu thanh toán";

/* HTTP result code string */
"precondition failed" = "tiền đề không thành công";

/* HTTP result code string */
"proxy authentication required" = "yêu cầu xác thực proxy";

/* HTTP result code string */
"redirected" = "đã chuyển hướng";

/* HTTP result code string */
"no longer exists" = "không tồn tại nữa";

/* HTTP result code string */
"request timed out" = "yêu cầu hết thời gian chờ";

/* HTTP result code string */
"request too large" = "yêu cầu quá lớn";

/* HTTP result code string */
"requested URL too long" = "URL được yêu cầu quá dài";

/* HTTP result code string */
"requested range not satisfiable" = "dải yêu cầu không thỏa mãn";

/* HTTP result code string */
"reset content" = "đặt lại nội dung";

/* HTTP result code string */
"see other" = "xem phần khác";

/* HTTP result code string */
"server error" = "lỗi máy chủ";

/* HTTP result code string */
"service unavailable" = "dịch vụ không khả dụng";

/* HTTP result code string */
"success" = "thành công";

/* HTTP result code string */
"switching protocols" = "chuyển giao thức";

/* HTTP result code string */
"temporarily redirected" = "tạm thời chuyển hướng";

/* HTTP result code string */
"unacceptable" = "không thể chấp nhận";

/* HTTP result code string */
"unauthorized" = "không được ủy quyền";

/* HTTP result code string */
"unimplemented" = "chưa thực hiện";

/* HTTP result code string */
"unsupported media type" = "loại phương tiện không được hỗ trợ";

/* HTTP result code string */
"unsupported version" = "phiên bản không được hỗ trợ";

/* kCFErrorHTTPProxyConnectionFailure description */
"Err306" = "Đã xảy ra sự cố khi liên lạc với máy chủ proxy web (HTTP).";

/* kCFErrorHTTPSProxyConnectionFailure description */
"Err310" = "Đã xảy ra sự cố khi liên lạc với máy chủ proxy web an toàn (HTTPS).";

/* WebFoundationErrorUnknown description */
"Err-998" = "lỗi không xác định";

/* WebFoundationErrorCancelled description */
"Err-999" = "đã huỷ";

/* WebFoundationErrorBadURLError description */
"Err-1000" = "URL không hợp lệ";

/* WebFoundationErrorTimedOut description */
"Err-1001" = "Yêu cầu hết thời gian chờ.";

/* WebFoundationErrorUnsupportedURL description */
"Err-1002" = "URL không được hỗ trợ";

/* WebFoundationErrorCannotFindHostError description */
"Err-1003" = "Không thể tìm thấy máy chủ có tên máy chủ được chỉ định.";

/* WebFoundationErrorCannotConnectToHostError description */
"Err-1004" = "Không thể kết nối máy chủ.";

/* WebFoundationErrorNetworkConnectionLostError description */
"Err-1005" = "Đã mất kết nối mạng.";

/* WebFoundationErrorDNSLookupError description */
"Err-1006" = "lỗi tra cứu DNS";

/* WebFoundationErrorHTTPTooManyRedirectsError description */
"Err-1007" = "quá nhiều chuyển hướng HTTP";

/* WebFoundationErrorResourceUnavailableError description */
"Err-1008" = "tài nguyên không khả dụng";

/* WebFoundationErrorNotConnectedToInternetError description */
"Err-1009" = "Kết nối Internet có vẻ như không hoạt động.";

/* WebFoundationErrorRedirectToNonExistentLocation description */
"Err-1010" = "không chuyển hướng đến đâu cả";

/* WebFoundationErrorBadServerResponseError description */
"Err-1011" = "Đã có phản hồi không hợp lệ từ máy chủ.";

/* WebFoundationErrorZeroByteResourceError description */
"Err-1014" = "tài nguyên 0 byte";

/* WebFoundationErrorCannotDecodeRawData description */
"Err-1015" = "không thể giải mã dữ liệu thô";

/* WebFoundationErrorCannotDecodeContentData description */
"Err-1016" = "không thể giải mã dữ liệu nội dung";

/* WebFoundationErrorCannotParseResponse description */
"Err-1017" = "không thể phân tích cú pháp phản hồi";

/* kCFURLErrorInternationalRoamingOff description */
"Err-1018" = "Hiện đang tắt chuyển vùng quốc tế.";

/* kCFURLErrorCallIsActive description */
"Err-1019" = "Không thể thiết lập kết nối dữ liệu vì đang có cuộc gọi.";

/* kCFURLErrorDataNotAllowed description */
"Err-1020" = "Hiện không cho phép kết nối dữ liệu.";

/* kCFURLErrorRequestBodyStreamExhausted description.  Should never be seen by an end user. */
"Err-1021" = "yêu cầu phần thân luồng đã dùng hết";
	
/* WebFoundationErrorFileDoesNotExist description */
"Err-1100" = "Không tìm thấy URL được yêu cầu trên máy chủ này.";

/* WebFoundationErrorFileIsDirectory description */
"Err-1101" = "tệp là thư mục";

/* WebFoundationErrorNoPermissionsToReadFile description */
"Err-1102" = "Bạn không có quyền truy cập tài nguyên được yêu cầu.";

/* WebFoundationErrorDataLengthExceedsMaximum description */
"Err-1103" = "tài nguyên vượt quá kích cỡ tối đa";

/* WebFoundationErrorSecureConnectionFailed description */
"Err-1200" = "Đã xảy ra lỗi SSL và không thể thực hiện kết nối an toàn tới máy chủ.";

/* WebFoundationErrorServerCertificateHasBadDate description */
"Err-1201" = "Chứng nhận cho máy chủ này đã hết hạn.";

/* WebFoundationErrorServerCertificateHasBadDate description */
"Err-1201.w" = "Chứng nhận cho máy chủ này đã hết hạn. Bạn có thể đang kết nối máy chủ giả làm “%@”, việc này có thể gây nguy hiểm cho thông tin bảo mật của bạn.";

/* WebFoundationErrorServerCertificateUntrusted description */
"Err-1202" = "Chứng nhận cho máy chủ này không hợp lệ.";

/* WebFoundationErrorServerCertificateUntrusted description */
"Err-1202.w" = "Chứng nhận cho máy chủ này không hợp lệ. Bạn có thể đang kết nối máy chủ giả làm “%@”, việc này có thể gây nguy hiểm cho thông tin bảo mật của bạn.";

/* WebFoundationErrorServerCertificateHasUnknownRoot description */
"Err-1203" = "Chứng nhận cho máy chủ này được xác thực bởi cơ quan chứng thực không xác định.";

/* WebFoundationErrorServerCertificateHasUnknownRoot description */
"Err-1203.w" = "Chứng nhận cho máy chủ này được xác thực bởi cơ quan chứng thực không xác định. Bạn có thể đang kết nối máy chủ giả làm “%@”, việc này có thể gây nguy hiểm cho thông tin bảo mật của bạn.";

/* WebFoundationErrorServerCertificateNotYetValid description */
"Err-1204" = "Chứng nhận cho máy chủ này chưa hợp lệ.";

/* WebFoundationErrorServerCertificateNotYetValid description */
"Err-1204.w" = "Chứng nhận cho máy chủ này chưa hợp lệ. Bạn có thể đang kết nối máy chủ giả làm “%@”, việc này có thể gây nguy hiểm cho thông tin bảo mật của bạn.";

/* WebFoundationErrorClientCertificateRejected description */
"Err-1205" = "Máy chủ không chấp nhận chứng nhận.";

/* WebFoundationErrorClientCertificateRejected description */
"Err-1205.w" = "Máy chủ \"%@\" không chấp nhận chứng nhận.";

/* WebFoundationErrorClientCertificateRequired description */
"Err-1206" = "Máy chủ yêu cầu chứng nhận máy khách.";

/* WebFoundationErrorClientCertificateRequired description */
"Err-1206.w" = "Máy chủ \"%@\" yêu cầu chứng nhận máy khách.";

/* WebFoundationErrorCannotLoadFromNetworkError description */
"Err-2000" = "không thể tải từ mạng";

/* WebFoundationErrorCannotCreateFile description */
"Err-3000" = "Không thể tạo tệp";

/* WebFoundationErrorCannotOpenFile description */
"Err-3001" = "Không thể mở tệp";

/* WebFoundationErrorCannotCloseFile description */
"Err-3002" = "Đã xảy ra sự cố trong khi đóng tệp";

/* WebFoundationErrorCannotWriteToFile description */
"Err-3003" = "Không thể ghi tệp";

/* WebFoundationErrorCannotRemoveFile description */
"Err-3004" = "Không thể xóa tệp";

/* WebFoundationErrorCannotMoveFile description */
"Err-3005" = "Không thể di chuyển tệp";

/* WebFoundationErrorDownloadDecodingFailedMidStream description */
"Err-3006" = "Không giải mã được bản tải về";

/* WebFoundationErrorDownloadDecodingFailedToComplete description */
"Err-3007" = "Không giải mã được bản tải về";

/* Recovery suggestion */
"Would you like to connect to the server anyway?" = "Bạn vẫn muốn kết nối với máy chủ?";

/* Recovery suggestion */
"Please check your proxy settings. For help with this problem, contact your system administrator." = "Vui lòng kiểm tra cài đặt proxy của bạn. Để được trợ giúp về vấn đề này, hãy liên hệ với quản trị viên hệ thống của bạn.";

/* AuthBrokerAgent proxy credential user notification - alert header */
"Proxy Authentication Required" = "Yêu cầu Xác thực Proxy";

/* AuthBrokerAgent proxy credential user notification - alert message, args are 1) proxy type, 2) host name, 3) port number, e.g.:  Authentication for HTTP proxy csd3.apple.com:8080 */
"Authentication for %@ proxy\n%@:%d" = "Xác thực cho proxy %@\n%@:%d";

/* AuthBrokerAgent proxy credential user notification - Cancel button title */
"Cancel" = "Hủy";

/* AuthBrokerAgent proxy credential user notification - Username title */
"Username" = "Tên người dùng";

/* AuthBrokerAgent proxy credential user notification - Password title */
"Password" = "Mật khẩu";
